Autodesk.Revit.DB.ConnectionValidationInfo.GetWarning(System.Int32)
Access specific warning number of warnings generated by reload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid index.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2016

Autodesk.Revit.DB.ConnectionValidationInfo.IsValidWarningIndex(System.Int32)
Validate warning index.
Since:
2016

Autodesk.Revit.DB.ConnectionValidationInfo.ManyWarnings
Returns number of warnings generated by reload.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2016

Autodesk.Revit.DB.ConnectionValidationInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ConnectionValidationInfo.#ctor
Constructor.
Since:
2016

Autodesk.Revit.DB.ConnectionValidationInfo
This object contains information about fabrication connection validations.
Since:
2016